{"id": "8d6608c1-5b62-476f-b273-6f00e73573db", "displayName": "App enforced restrictions - SPO limited", "createdDateTime": "2023-01-29T16:06:15.0240865Z", "modifiedDateTime": "2023-02-06T09:38:09.0359942Z", "state": "disabled", "grantControls": null, "conditions": {"userRiskLevels": [], "signInRiskLevels": [], "clientAppTypes": ["all"], "servicePrincipalRiskLevels": [], "platforms": null, "locations": null, "times": null, "deviceStates": null, "devices": null, "clientApplications": null, "applications": {"includeApplications": ["Office365"], "excludeApplications": [], "includeUserActions": [], "includeAuthenticationContextClassReferences": []}, "users": {"includeUsers": ["All"], "excludeUsers": [], "includeGroups": [], "excludeGroups": [], "includeRoles": [], "excludeRoles": [], "includeGuestsOrExternalUsers": null, "excludeGuestsOrExternalUsers": null}}, "sessionControls": {"disableResilienceDefaults": false, "cloudAppSecurity": null, "signInFrequency": null, "persistentBrowser": null, "continuousAccessEvaluation": null, "secureSignInSession": null, "applicationEnforcedRestrictions": {"isEnabled": true}}}