{"id": "b3be0a03-bf00-4c17-bd22-1135db62517a", "displayName": "CA MCAS", "createdDateTime": "2022-08-31T07:23:16.081425Z", "modifiedDateTime": "2023-01-28T05:03:39.3502366Z", "state": "enabled", "grantControls": null, "conditions": {"userRiskLevels": [], "signInRiskLevels": [], "clientAppTypes": ["all"], "servicePrincipalRiskLevels": [], "platforms": null, "locations": null, "times": null, "deviceStates": null, "devices": null, "clientApplications": null, "applications": {"includeApplications": ["All"], "excludeApplications": [], "includeUserActions": [], "includeAuthenticationContextClassReferences": []}, "users": {"includeUsers": ["All"], "excludeUsers": [], "includeGroups": [], "excludeGroups": [], "includeRoles": [], "excludeRoles": [], "includeGuestsOrExternalUsers": null, "excludeGuestsOrExternalUsers": null}}, "sessionControls": {"disableResilienceDefaults": false, "applicationEnforcedRestrictions": null, "signInFrequency": null, "persistentBrowser": null, "continuousAccessEvaluation": null, "secureSignInSession": null, "cloudAppSecurity": {"cloudAppSecurityType": "mcasConfigured", "isEnabled": true}}}