{
    "id": "60f2c970-54e0-4125-8188-18993bccd430",
    "displayName": "CA001-Global-BaseProtection-AllApps-AnyPlatform-BlockNonPersonas",
    "createdDateTime": "2023-04-13T06:59:55.6411266Z",
    "modifiedDateTime": null,
    "state": "enabledForReportingButNotEnforced",
    "sessionControls": null,
    "conditions": {
        "userRiskLevels": [],
        "signInRiskLevels": [],
        "clientAppTypes": [
            "all"
        ],
        "servicePrincipalRiskLevels": [],
        "platforms": null,
        "locations": null,
        "times": null,
        "deviceStates": null,
        "devices": null,
        "clientApplications": null,
        "applications": {
            "includeApplications": [
                "All"
            ],
            "excludeApplications": [],
            "includeUserActions": [],
            "includeAuthenticationContextClassReferences": []
        },
        "users": {
            "includeUsers": [
                "All"
            ],
            "excludeUsers": [
                "ed241030-22ab-4072-bdcb-3525d4be7d29"
            ],
            "includeGroups": [],
            "excludeGroups": [
                "53afd8d4-7ba6-4728-832b-34c5ac878d4a",
                "2f2a7260-814d-4314-b650-9573f2dd9337",
                "5253ba0b-6708-4ff1-9073-c1fe795023d1",
                "bf7f4354-58b7-4b66-a476-a17319186143",
                "33100916-fc7b-44f1-b48f-903791e0714e",
                "5097f9ec-10fa-4acf-a242-1a568bf30f64",
                "3ebfafa7-8469-48d7-b678-610b675c0d38",
                "e3ff23b4-80be-48e3-aaca-cd2f69f5d9a3",
                "2f3de830-61db-4c02-ad21-eb614589b0ce",
                "1b47294f-4d6e-4673-aff9-44928a4edff0",
                "4dd02aca-9a06-4c68-8a44-97699a8450e4",
                "15da3d9b-ec93-4d53-8c26-df1a0cf8fb11",
                "5e20dc3a-1b11-4e75-8602-5d9aad5d1b27"
            ],
            "includeRoles": [],
            "excludeRoles": [],
            "includeGuestsOrExternalUsers": null,
            "excludeGuestsOrExternalUsers": null
        }
    },
    "grantControls": {
        "operator": "OR",
        "builtInControls": [
            "block"
        ],
        "customAuthenticationFactors": [],
        "termsOfUse": [],
        "authenticationStrength@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies('60f2c970-54e0-4125-8188-18993bccd430')/grantControls/authenticationStrength/$entity",
        "authenticationStrength": null
    }
}