{"id": "c166994c-451f-46ec-aa1e-abd0b6a19b5d", "displayName": "CA100_BaseProtection_ AllUsers_RegisterSecurityInfo_AllePlattformen_UntrustedLocation_BlockAccess", "createdDateTime": "2023-02-06T07:51:34.68013Z", "modifiedDateTime": "2023-02-06T09:15:53.6278512Z", "state": "disabled", "sessionControls": null, "conditions": {"userRiskLevels": [], "signInRiskLevels": [], "clientAppTypes": ["all"], "servicePrincipalRiskLevels": [], "platforms": null, "times": null, "deviceStates": null, "devices": null, "clientApplications": null, "applications": {"includeApplications": [], "excludeApplications": [], "includeUserActions": ["urn:user:registersecurityinfo"], "includeAuthenticationContextClassReferences": []}, "users": {"includeUsers": ["All"], "excludeUsers": [], "includeGroups": [], "excludeGroups": ["796df650-fdb9-4ae2-9ec8-5355e4a4005b", "1e692340-c963-4ed3-8c37-8d3d65a8dced"], "includeRoles": [], "excludeRoles": [], "includeGuestsOrExternalUsers": null, "excludeGuestsOrExternalUsers": null}, "locations": {"includeLocations": ["All"], "excludeLocations": ["AllTrusted"]}}, "grantControls": {"operator": "OR", "builtInControls": ["block"], "customAuthenticationFactors": [], "termsOfUse": [], "authenticationStrength@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies('c166994c-451f-46ec-aa1e-abd0b6a19b5d')/grantControls/authenticationStrength/$entity", "authenticationStrength": null}}