{"id": "b3881669-dc0a-41ee-b846-8474e69d5dcf", "displayName": "CA100_BaseProtection_Admins(limited)_AllApps_AllPlatforms_RequireMFA_TMP", "createdDateTime": "2022-05-25T09:11:16.049962Z", "modifiedDateTime": "2022-09-20T09:11:58.2007243Z", "state": "enabled", "conditions": {"userRiskLevels": [], "signInRiskLevels": [], "clientAppTypes": ["all"], "servicePrincipalRiskLevels": [], "platforms": null, "locations": null, "times": null, "deviceStates": null, "devices": null, "clientApplications": null, "applications": {"includeApplications": ["All"], "excludeApplications": [], "includeUserActions": [], "includeAuthenticationContextClassReferences": []}, "users": {"includeUsers": ["be99358e-3c32-4528-bc0f-4764a5037e45", "b4943779-077f-46ad-8322-90794524207b", "c74a440c-5822-4ca8-8c70-9ba27eed07f0"], "excludeUsers": ["66e5a220-1982-407d-b774-d2d7afe9160a", "4bab315a-934b-44aa-9890-480705c96564", "c9d712e4-0d62-4850-8f63-790f67eb73d5", "f519ba14-f882-4cd2-a2c9-c97f2d7392d2", "96924661-508d-447a-b63c-81aee9f82a7d", "11ef3c2d-adff-4c14-9e61-0bafefcd878f", "56228e27-b851-43cd-8b91-0f8c5b82a0b9", "e3e46e9b-ef1f-4f73-b09b-77efcd47b441"], "includeGroups": [], "excludeGroups": ["2794caf9-be16-42a8-b962-3341ad444a8e"], "includeRoles": ["62e90394-69f5-4237-9190-012177145e10", "b0f54661-2d74-4c50-afa3-1ec803f12efe", "c4e39bd9-1100-46d3-8c65-fb160da0071f", "9b895d92-2cd3-44c7-9d02-a6ac2d5ea5c3", "729827e3-9c14-49f7-bb1b-9608f156bbb8", "194ae4cb-b126-40b2-bd5b-6091b380977d", "b1be1c3e-b65d-4f19-8427-f6fa0d97feb9", "e8611ab8-c189-46e8-94e1-60213ab1f814", "892c5842-a9a6-463a-8041-72aa08ca3cf6", "69091246-20e8-4a56-aa4d-066075b2a7a8", "29232cdf-9323-42fd-ade2-1d097af3e4de", "f28a1f50-f6e7-4571-818b-6a12f2af6b6c", "5d6b6bb7-de71-4623-b4af-96380a352509", "0526716b-113d-4c15-b2c8-68e3c22b9f80"], "excludeRoles": ["d29b2b05-8046-44ba-8758-1e26182fcf32"], "includeGuestsOrExternalUsers": null, "excludeGuestsOrExternalUsers": null}}, "grantControls": {"operator": "OR", "builtInControls": ["mfa"], "customAuthenticationFactors": [], "termsOfUse": [], "authenticationStrength@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies('b3881669-dc0a-41ee-b846-8474e69d5dcf')/grantControls/authenticationStrength/$entity", "authenticationStrength": null}, "sessionControls": {"disableResilienceDefaults": false, "applicationEnforcedRestrictions": null, "cloudAppSecurity": null, "persistentBrowser": null, "continuousAccessEvaluation": null, "secureSignInSession": null, "signInFrequency": {"value": 1, "type": "days", "authenticationType": "primaryAndSecondaryAuthentication", "frequencyInterval": "timeBased", "isEnabled": true}}}