{"id": "f95cff4c-20fe-491d-81be-0cef13adaf41", "displayName": "CA106-Admins-DataandAppProtection-AllApps-iOSorAndroid-ClientAppandAPP", "createdDateTime": "2023-04-13T07:00:08.3145026Z", "modifiedDateTime": null, "state": "enabledForReportingButNotEnforced", "sessionControls": null, "conditions": {"userRiskLevels": [], "signInRiskLevels": [], "clientAppTypes": ["all"], "servicePrincipalRiskLevels": [], "locations": null, "times": null, "deviceStates": null, "devices": null, "clientApplications": null, "applications": {"includeApplications": ["All"], "excludeApplications": [], "includeUserActions": [], "includeAuthenticationContextClassReferences": []}, "users": {"includeUsers": [], "excludeUsers": [], "includeGroups": ["bf7f4354-58b7-4b66-a476-a17319186143"], "excludeGroups": ["53afd8d4-7ba6-4728-832b-34c5ac878d4a", "3ebfafa7-8469-48d7-b678-610b675c0d38", "2f3de830-61db-4c02-ad21-eb614589b0ce", "e3ff23b4-80be-48e3-aaca-cd2f69f5d9a3", "f2e3e8fc-0401-4ac6-bc3c-934ecfc602b4", "3b534fd6-00be-43a4-ab89-f8c513bcd148"], "includeRoles": [], "excludeRoles": [], "includeGuestsOrExternalUsers": null, "excludeGuestsOrExternalUsers": null}, "platforms": {"includePlatforms": ["android", "iOS"], "excludePlatforms": []}}, "grantControls": {"operator": "OR", "builtInControls": ["approvedApplication", "compliantApplication"], "customAuthenticationFactors": [], "termsOfUse": [], "authenticationStrength@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies('f95cff4c-20fe-491d-81be-0cef13adaf41')/grantControls/authenticationStrength/$entity", "authenticationStrength": null}}