{"id": "2d7eafa0-c351-491b-abf6-121b6ab90a5a", "displayName": "CA104_BaseProtection_ExternalUsers_AllApps_AllPlatforms_RequireMFA", "createdDateTime": "2022-09-20T09:09:39.5919526Z", "modifiedDateTime": "2023-02-16T13:29:57.1637773Z", "state": "enabled", "sessionControls": null, "conditions": {"userRiskLevels": [], "signInRiskLevels": [], "clientAppTypes": ["all"], "servicePrincipalRiskLevels": [], "platforms": null, "locations": null, "times": null, "deviceStates": null, "devices": null, "clientApplications": null, "applications": {"includeApplications": ["All"], "excludeApplications": [], "includeUserActions": [], "includeAuthenticationContextClassReferences": []}, "users": {"includeUsers": [], "excludeUsers": ["66e5a220-1982-407d-b774-d2d7afe9160a"], "includeGroups": [], "excludeGroups": [], "includeRoles": [], "excludeRoles": [], "excludeGuestsOrExternalUsers": null, "includeGuestsOrExternalUsers": {"guestOrExternalUserTypes": "internalGuest,b2bCollaborationGuest,b2bCollaborationMember,b2bDirectConnectUser,otherExternalUser,serviceProvider", "externalTenants": {"@odata.type": "#microsoft.graph.conditionalAccessAllExternalTenants", "membershipKind": "all"}}}}, "grantControls": {"operator": "OR", "builtInControls": ["mfa"], "customAuthenticationFactors": [], "termsOfUse": [], "authenticationStrength@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies('2d7eafa0-c351-491b-abf6-121b6ab90a5a')/grantControls/authenticationStrength/$entity", "authenticationStrength": null}}