{"id": "f5776498-594f-4a6a-b49a-c4cc792a3d12", "displayName": "CA107_BaseProtection_ExternalUsers_AllApps_AllPlatforms_RequireMFA", "createdDateTime": "2023-02-06T07:59:44.9098204Z", "modifiedDateTime": "2023-02-06T09:18:12.1742053Z", "state": "disabled", "sessionControls": null, "conditions": {"userRiskLevels": [], "signInRiskLevels": [], "clientAppTypes": ["all"], "servicePrincipalRiskLevels": [], "platforms": null, "locations": null, "times": null, "deviceStates": null, "devices": null, "clientApplications": null, "applications": {"includeApplications": ["All"], "excludeApplications": [], "includeUserActions": [], "includeAuthenticationContextClassReferences": []}, "users": {"includeUsers": [], "excludeUsers": [], "includeGroups": [], "excludeGroups": ["796df650-fdb9-4ae2-9ec8-5355e4a4005b", "1e692340-c963-4ed3-8c37-8d3d65a8dced"], "includeRoles": [], "excludeRoles": [], "excludeGuestsOrExternalUsers": null, "includeGuestsOrExternalUsers": {"guestOrExternalUserTypes": "internalGuest,b2bCollaborationGuest,b2bCollaborationMember,b2bDirectConnectUser,otherExternalUser,serviceProvider", "externalTenants": {"@odata.type": "#microsoft.graph.conditionalAccessAllExternalTenants", "membershipKind": "all"}}}}, "grantControls": {"operator": "OR", "builtInControls": ["mfa"], "customAuthenticationFactors": [], "termsOfUse": [], "authenticationStrength@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies('f5776498-594f-4a6a-b49a-c4cc792a3d12')/grantControls/authenticationStrength/$entity", "authenticationStrength": null}}