{
    "id": "d44af52d-1748-4980-86fa-8c92cd3a0070",
    "displayName": "CA101-Admins-IdentityProtection-AllApps-AnyPlatform-CombinedRegistration",
    "createdDateTime": "2023-04-13T07:00:05.6513271Z",
    "modifiedDateTime": null,
    "state": "enabledForReportingButNotEnforced",
    "sessionControls": null,
    "conditions": {
        "userRiskLevels": [],
        "signInRiskLevels": [],
        "clientAppTypes": [
            "all"
        ],
        "servicePrincipalRiskLevels": [],
        "platforms": null,
        "locations": null,
        "times": null,
        "deviceStates": null,
        "devices": null,
        "clientApplications": null,
        "applications": {
            "includeApplications": [],
            "excludeApplications": [],
            "includeUserActions": [
                "urn:user:registersecurityinfo"
            ],
            "includeAuthenticationContextClassReferences": []
        },
        "users": {
            "includeUsers": [],
            "excludeUsers": [],
            "includeGroups": [
                "bf7f4354-58b7-4b66-a476-a17319186143"
            ],
            "excludeGroups": [
                "53afd8d4-7ba6-4728-832b-34c5ac878d4a",
                "3ebfafa7-8469-48d7-b678-610b675c0d38",
                "2f3de830-61db-4c02-ad21-eb614589b0ce",
                "e3ff23b4-80be-48e3-aaca-cd2f69f5d9a3",
                "6dd544d1-4ca0-43bf-8241-63a29e55d7ac"
            ],
            "includeRoles": [],
            "excludeRoles": [],
            "includeGuestsOrExternalUsers": null,
            "excludeGuestsOrExternalUsers": null
        }
    },
    "grantControls": {
        "operator": "AND",
        "builtInControls": [
            "compliantDevice",
            "domainJoinedDevice"
        ],
        "customAuthenticationFactors": [],
        "termsOfUse": [],
        "authenticationStrength@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies('d44af52d-1748-4980-86fa-8c92cd3a0070')/grantControls/authenticationStrength/$entity",
        "authenticationStrength": null
    }
}