{"id": "12ee8eb9-3f5a-4d3b-bebd-33342568403c", "displayName": "CA105-Admins-AppProtection-MicrosoftIntuneEnrollment-AnyPlatform-MFA", "createdDateTime": "2023-04-13T07:00:07.4110432Z", "modifiedDateTime": null, "state": "enabledForReportingButNotEnforced", "sessionControls": null, "conditions": {"userRiskLevels": [], "signInRiskLevels": [], "clientAppTypes": ["all"], "servicePrincipalRiskLevels": [], "platforms": null, "locations": null, "times": null, "deviceStates": null, "devices": null, "clientApplications": null, "applications": {"includeApplications": ["0000000a-0000-0000-c000-000000000000"], "excludeApplications": [], "includeUserActions": [], "includeAuthenticationContextClassReferences": []}, "users": {"includeUsers": [], "excludeUsers": [], "includeGroups": ["bf7f4354-58b7-4b66-a476-a17319186143"], "excludeGroups": ["53afd8d4-7ba6-4728-832b-34c5ac878d4a", "3ebfafa7-8469-48d7-b678-610b675c0d38", "2f3de830-61db-4c02-ad21-eb614589b0ce", "e3ff23b4-80be-48e3-aaca-cd2f69f5d9a3", "3b534fd6-00be-43a4-ab89-f8c513bcd148"], "includeRoles": [], "excludeRoles": [], "includeGuestsOrExternalUsers": null, "excludeGuestsOrExternalUsers": null}}, "grantControls": {"operator": "OR", "builtInControls": ["mfa"], "customAuthenticationFactors": [], "termsOfUse": [], "authenticationStrength@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies('12ee8eb9-3f5a-4d3b-bebd-33342568403c')/grantControls/authenticationStrength/$entity", "authenticationStrength": null}}