{"id": "7109b0cd-9579-4324-b561-d8ab4abe4d5e", "displayName": "CA107-Admins-DataProtection-AllApps-AnyPlatform-SessionPolicy", "createdDateTime": "2023-04-13T07:00:09.1998443Z", "modifiedDateTime": null, "state": "enabledForReportingButNotEnforced", "conditions": {"userRiskLevels": [], "signInRiskLevels": [], "clientAppTypes": ["all"], "servicePrincipalRiskLevels": [], "platforms": null, "locations": null, "times": null, "deviceStates": null, "devices": null, "clientApplications": null, "applications": {"includeApplications": ["All"], "excludeApplications": [], "includeUserActions": [], "includeAuthenticationContextClassReferences": []}, "users": {"includeUsers": [], "excludeUsers": [], "includeGroups": ["bf7f4354-58b7-4b66-a476-a17319186143"], "excludeGroups": ["53afd8d4-7ba6-4728-832b-34c5ac878d4a", "3ebfafa7-8469-48d7-b678-610b675c0d38", "2f3de830-61db-4c02-ad21-eb614589b0ce", "e3ff23b4-80be-48e3-aaca-cd2f69f5d9a3", "f2e3e8fc-0401-4ac6-bc3c-934ecfc602b4"], "includeRoles": [], "excludeRoles": [], "includeGuestsOrExternalUsers": null, "excludeGuestsOrExternalUsers": null}}, "grantControls": {"operator": "OR", "builtInControls": ["block"], "customAuthenticationFactors": [], "termsOfUse": [], "authenticationStrength@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies('7109b0cd-9579-4324-b561-d8ab4abe4d5e')/grantControls/authenticationStrength/$entity", "authenticationStrength": null}, "sessionControls": {"disableResilienceDefaults": false, "applicationEnforcedRestrictions": null, "cloudAppSecurity": null, "continuousAccessEvaluation": null, "secureSignInSession": null, "signInFrequency": {"value": 4, "type": "hours", "authenticationType": "primaryAndSecondaryAuthentication", "frequencyInterval": "timeBased", "isEnabled": true}, "persistentBrowser": {"mode": "never", "isEnabled": true}}}