{"id": "40abece2-37a5-4f69-8f02-79322552268e", "displayName": "CA1006-Developers-DataandAppProtection-AllApps-iOSorAndroid-ClientAppORAPP", "createdDateTime": "2023-04-13T07:00:03.4940475Z", "modifiedDateTime": null, "state": "enabledForReportingButNotEnforced", "sessionControls": null, "conditions": {"userRiskLevels": [], "signInRiskLevels": [], "clientAppTypes": ["all"], "servicePrincipalRiskLevels": [], "locations": null, "times": null, "deviceStates": null, "devices": null, "clientApplications": null, "applications": {"includeApplications": ["All"], "excludeApplications": [], "includeUserActions": [], "includeAuthenticationContextClassReferences": []}, "users": {"includeUsers": [], "excludeUsers": [], "includeGroups": ["5097f9ec-10fa-4acf-a242-1a568bf30f64"], "excludeGroups": ["53afd8d4-7ba6-4728-832b-34c5ac878d4a", "54ab779f-a23c-40f2-a72d-99e627033a62"], "includeRoles": [], "excludeRoles": [], "includeGuestsOrExternalUsers": null, "excludeGuestsOrExternalUsers": null}, "platforms": {"includePlatforms": ["android", "iOS"], "excludePlatforms": ["android", "iOS", "macOS", "linux"]}}, "grantControls": {"operator": "OR", "builtInControls": ["approvedApplication", "compliantApplication"], "customAuthenticationFactors": [], "termsOfUse": [], "authenticationStrength@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies('40abece2-37a5-4f69-8f02-79322552268e')/grantControls/authenticationStrength/$entity", "authenticationStrength": null}}