{
    "id": "ae81faad-62c3-404d-a19b-6e25372f4e9a",
    "displayName": "CA1001-Developers-BaseProtection-AllApps-AnyPlatform-MFAfromUnamagedDevices",
    "createdDateTime": "2023-04-13T06:59:59.8630168Z",
    "modifiedDateTime": null,
    "state": "enabledForReportingButNotEnforced",
    "sessionControls": null,
    "conditions": {
        "userRiskLevels": [],
        "signInRiskLevels": [],
        "clientAppTypes": [
            "all"
        ],
        "servicePrincipalRiskLevels": [],
        "platforms": null,
        "locations": null,
        "times": null,
        "deviceStates": null,
        "clientApplications": null,
        "applications": {
            "includeApplications": [
                "All"
            ],
            "excludeApplications": [],
            "includeUserActions": [],
            "includeAuthenticationContextClassReferences": []
        },
        "users": {
            "includeUsers": [],
            "excludeUsers": [],
            "includeGroups": [
                "5097f9ec-10fa-4acf-a242-1a568bf30f64"
            ],
            "excludeGroups": [
                "53afd8d4-7ba6-4728-832b-34c5ac878d4a",
                "54ab779f-a23c-40f2-a72d-99e627033a62"
            ],
            "includeRoles": [],
            "excludeRoles": [],
            "includeGuestsOrExternalUsers": null,
            "excludeGuestsOrExternalUsers": null
        },
        "devices": {
            "includeDeviceStates": [],
            "excludeDeviceStates": [],
            "includeDevices": [],
            "excludeDevices": [],
            "deviceFilter": {
                "mode": "include",
                "rule": "device.trustType -ne \"AzureAD\" -and device.trustType -ne \"ServerAD\""
            }
        }
    },
    "grantControls": {
        "operator": "OR",
        "builtInControls": [
            "mfa"
        ],
        "customAuthenticationFactors": [],
        "termsOfUse": [],
        "authenticationStrength@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies('ae81faad-62c3-404d-a19b-6e25372f4e9a')/grantControls/authenticationStrength/$entity",
        "authenticationStrength": null
    }
}