{
    "id": "63cb6ca2-f7df-4b0a-aea3-1a0e97ff146e",
    "displayName": "CA100-Admins-BaseProtection-AllApps-AnyPlatform-CompliantandMFA",
    "createdDateTime": "2023-04-13T06:59:57.5469723Z",
    "modifiedDateTime": null,
    "state": "enabledForReportingButNotEnforced",
    "sessionControls": null,
    "conditions": {
        "userRiskLevels": [],
        "signInRiskLevels": [],
        "clientAppTypes": [
            "all"
        ],
        "servicePrincipalRiskLevels": [],
        "platforms": null,
        "locations": null,
        "times": null,
        "deviceStates": null,
        "devices": null,
        "clientApplications": null,
        "applications": {
            "includeApplications": [
                "All"
            ],
            "excludeApplications": [
                "0000000a-0000-0000-c000-000000000000"
            ],
            "includeUserActions": [],
            "includeAuthenticationContextClassReferences": []
        },
        "users": {
            "includeUsers": [],
            "excludeUsers": [],
            "includeGroups": [
                "bf7f4354-58b7-4b66-a476-a17319186143"
            ],
            "excludeGroups": [
                "53afd8d4-7ba6-4728-832b-34c5ac878d4a",
                "3ebfafa7-8469-48d7-b678-610b675c0d38",
                "e3ff23b4-80be-48e3-aaca-cd2f69f5d9a3",
                "2f3de830-61db-4c02-ad21-eb614589b0ce",
                "6dd544d1-4ca0-43bf-8241-63a29e55d7ac"
            ],
            "includeRoles": [],
            "excludeRoles": [],
            "includeGuestsOrExternalUsers": null,
            "excludeGuestsOrExternalUsers": null
        }
    },
    "grantControls": {
        "operator": "AND",
        "builtInControls": [
            "mfa",
            "compliantDevice"
        ],
        "customAuthenticationFactors": [],
        "termsOfUse": [],
        "authenticationStrength@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies('63cb6ca2-f7df-4b0a-aea3-1a0e97ff146e')/grantControls/authenticationStrength/$entity",
        "authenticationStrength": null
    }
}