{"id": "263bb13a-52b9-4f3a-9c48-2b4df64150d3", "displayName": "CA1004-Developers-IdentityProtection-AllApps-AnyPlatform-BlockLegacyAuth", "createdDateTime": "2023-04-13T07:00:00.9766179Z", "modifiedDateTime": null, "state": "enabledForReportingButNotEnforced", "sessionControls": null, "conditions": {"userRiskLevels": [], "signInRiskLevels": [], "clientAppTypes": ["exchangeActiveSync", "other"], "servicePrincipalRiskLevels": [], "platforms": null, "locations": null, "times": null, "deviceStates": null, "devices": null, "clientApplications": null, "applications": {"includeApplications": ["All"], "excludeApplications": [], "includeUserActions": [], "includeAuthenticationContextClassReferences": []}, "users": {"includeUsers": [], "excludeUsers": [], "includeGroups": ["5097f9ec-10fa-4acf-a242-1a568bf30f64"], "excludeGroups": ["53afd8d4-7ba6-4728-832b-34c5ac878d4a", "54ab779f-a23c-40f2-a72d-99e627033a62"], "includeRoles": [], "excludeRoles": [], "includeGuestsOrExternalUsers": null, "excludeGuestsOrExternalUsers": null}}, "grantControls": {"operator": "OR", "builtInControls": ["block"], "customAuthenticationFactors": [], "termsOfUse": [], "authenticationStrength@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies('263bb13a-52b9-4f3a-9c48-2b4df64150d3')/grantControls/authenticationStrength/$entity", "authenticationStrength": null}}