{
    "id": "7a3ce6bf-4bb2-4d1a-b632-502c096e092b",
    "displayName": "CA108-Admins-AttackSurfaceReduction-AllApps-AnyPlatform-BlockUnknownPlatforms",
    "createdDateTime": "2023-04-13T07:00:10.0148033Z",
    "modifiedDateTime": null,
    "state": "enabledForReportingButNotEnforced",
    "sessionControls": null,
    "conditions": {
        "userRiskLevels": [],
        "signInRiskLevels": [],
        "clientAppTypes": [
            "all"
        ],
        "servicePrincipalRiskLevels": [],
        "locations": null,
        "times": null,
        "deviceStates": null,
        "devices": null,
        "clientApplications": null,
        "applications": {
            "includeApplications": [
                "All"
            ],
            "excludeApplications": [],
            "includeUserActions": [],
            "includeAuthenticationContextClassReferences": []
        },
        "users": {
            "includeUsers": [],
            "excludeUsers": [],
            "includeGroups": [
                "bf7f4354-58b7-4b66-a476-a17319186143"
            ],
            "excludeGroups": [
                "53afd8d4-7ba6-4728-832b-34c5ac878d4a",
                "3ebfafa7-8469-48d7-b678-610b675c0d38",
                "2f3de830-61db-4c02-ad21-eb614589b0ce",
                "e3ff23b4-80be-48e3-aaca-cd2f69f5d9a3",
                "9fb26c43-6bc8-4582-b5f7-66c0d23f7481"
            ],
            "includeRoles": [],
            "excludeRoles": [],
            "includeGuestsOrExternalUsers": null,
            "excludeGuestsOrExternalUsers": null
        },
        "platforms": {
            "includePlatforms": [
                "all"
            ],
            "excludePlatforms": [
                "android",
                "iOS",
                "windows",
                "macOS",
                "linux"
            ]
        }
    },
    "grantControls": {
        "operator": "OR",
        "builtInControls": [
            "block"
        ],
        "customAuthenticationFactors": [],
        "termsOfUse": [],
        "authenticationStrength@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies('7a3ce6bf-4bb2-4d1a-b632-502c096e092b')/grantControls/authenticationStrength/$entity",
        "authenticationStrength": null
    }
}