{"id": "3f128ee7-ae95-4237-aac0-20e52732d82b", "displayName": "CA1104-Internals-IdentityProtection-AllApps-MAC-BlockLegacyAuth", "createdDateTime": "2023-04-13T07:00:13.5273605Z", "modifiedDateTime": null, "state": "enabledForReportingButNotEnforced", "sessionControls": null, "conditions": {"userRiskLevels": [], "signInRiskLevels": [], "clientAppTypes": ["exchangeActiveSync", "other"], "servicePrincipalRiskLevels": [], "locations": null, "times": null, "deviceStates": null, "devices": null, "clientApplications": null, "applications": {"includeApplications": ["All"], "excludeApplications": [], "includeUserActions": [], "includeAuthenticationContextClassReferences": []}, "users": {"includeUsers": [], "excludeUsers": [], "includeGroups": ["4dd02aca-9a06-4c68-8a44-97699a8450e4"], "excludeGroups": ["53afd8d4-7ba6-4728-832b-34c5ac878d4a", "cd02bb8a-403a-4d6d-a72e-ef3a55820fde"], "includeRoles": [], "excludeRoles": [], "includeGuestsOrExternalUsers": null, "excludeGuestsOrExternalUsers": null}, "platforms": {"includePlatforms": ["macOS"], "excludePlatforms": ["android", "iOS", "windows", "windowsPhone", "linux"]}}, "grantControls": {"operator": "OR", "builtInControls": ["block"], "customAuthenticationFactors": [], "termsOfUse": [], "authenticationStrength@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies('3f128ee7-ae95-4237-aac0-20e52732d82b')/grantControls/authenticationStrength/$entity", "authenticationStrength": null}}