{
    "id": "580e0f31-b67e-4728-99e1-779c5158e0da",
    "displayName": "CA1206-Internals--VIP-DataandAppProtection-AllApps-iOSorAndroid-ClientAppORAPP",
    "createdDateTime": "2023-04-13T07:00:19.0491311Z",
    "modifiedDateTime": null,
    "state": "enabledForReportingButNotEnforced",
    "sessionControls": null,
    "conditions": {
        "userRiskLevels": [],
        "signInRiskLevels": [],
        "clientAppTypes": [
            "all"
        ],
        "servicePrincipalRiskLevels": [],
        "locations": null,
        "times": null,
        "deviceStates": null,
        "devices": null,
        "clientApplications": null,
        "applications": {
            "includeApplications": [
                "Office365"
            ],
            "excludeApplications": [],
            "includeUserActions": [],
            "includeAuthenticationContextClassReferences": []
        },
        "users": {
            "includeUsers": [],
            "excludeUsers": [],
            "includeGroups": [
                "5e20dc3a-1b11-4e75-8602-5d9aad5d1b27"
            ],
            "excludeGroups": [
                "53afd8d4-7ba6-4728-832b-34c5ac878d4a",
                "cd02bb8a-403a-4d6d-a72e-ef3a55820fde"
            ],
            "includeRoles": [],
            "excludeRoles": [],
            "includeGuestsOrExternalUsers": null,
            "excludeGuestsOrExternalUsers": null
        },
        "platforms": {
            "includePlatforms": [
                "android",
                "iOS"
            ],
            "excludePlatforms": []
        }
    },
    "grantControls": {
        "operator": "OR",
        "builtInControls": [
            "approvedApplication",
            "compliantApplication"
        ],
        "customAuthenticationFactors": [],
        "termsOfUse": [],
        "authenticationStrength@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies('580e0f31-b67e-4728-99e1-779c5158e0da')/grantControls/authenticationStrength/$entity",
        "authenticationStrength": null
    }
}