{
    "id": "54b8e199-4cff-44f4-9992-a543577688ce",
    "displayName": "CA1205-Internals-VIP-AppProtection-MicrosoftIntuneEnrollment-AnyPlatform-MFA",
    "createdDateTime": "2023-04-13T07:00:17.8517101Z",
    "modifiedDateTime": null,
    "state": "enabledForReportingButNotEnforced",
    "sessionControls": null,
    "conditions": {
        "userRiskLevels": [],
        "signInRiskLevels": [],
        "clientAppTypes": [
            "all"
        ],
        "servicePrincipalRiskLevels": [],
        "platforms": null,
        "locations": null,
        "times": null,
        "deviceStates": null,
        "devices": null,
        "clientApplications": null,
        "applications": {
            "includeApplications": [
                "0000000a-0000-0000-c000-000000000000"
            ],
            "excludeApplications": [],
            "includeUserActions": [],
            "includeAuthenticationContextClassReferences": []
        },
        "users": {
            "includeUsers": [],
            "excludeUsers": [],
            "includeGroups": [
                "5e20dc3a-1b11-4e75-8602-5d9aad5d1b27"
            ],
            "excludeGroups": [
                "cd02bb8a-403a-4d6d-a72e-ef3a55820fde",
                "53afd8d4-7ba6-4728-832b-34c5ac878d4a"
            ],
            "includeRoles": [],
            "excludeRoles": [],
            "includeGuestsOrExternalUsers": null,
            "excludeGuestsOrExternalUsers": null
        }
    },
    "grantControls": {
        "operator": "OR",
        "builtInControls": [
            "mfa"
        ],
        "customAuthenticationFactors": [],
        "termsOfUse": [],
        "authenticationStrength@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies('54b8e199-4cff-44f4-9992-a543577688ce')/grantControls/authenticationStrength/$entity",
        "authenticationStrength": null
    }
}