{
    "id": "4de43d03-7a26-4e3c-9c4d-07b570694c4e",
    "displayName": "CA1207-Internals-VIP-AttackSurfaceReduction-AllApps-AnyPlatform-BlockUnknownPlatforms",
    "createdDateTime": "2023-04-13T07:00:19.9361086Z",
    "modifiedDateTime": null,
    "state": "enabledForReportingButNotEnforced",
    "sessionControls": null,
    "conditions": {
        "userRiskLevels": [],
        "signInRiskLevels": [],
        "clientAppTypes": [
            "all"
        ],
        "servicePrincipalRiskLevels": [],
        "locations": null,
        "times": null,
        "deviceStates": null,
        "devices": null,
        "clientApplications": null,
        "applications": {
            "includeApplications": [
                "All"
            ],
            "excludeApplications": [],
            "includeUserActions": [],
            "includeAuthenticationContextClassReferences": []
        },
        "users": {
            "includeUsers": [],
            "excludeUsers": [],
            "includeGroups": [
                "5e20dc3a-1b11-4e75-8602-5d9aad5d1b27"
            ],
            "excludeGroups": [
                "53afd8d4-7ba6-4728-832b-34c5ac878d4a",
                "cd02bb8a-403a-4d6d-a72e-ef3a55820fde"
            ],
            "includeRoles": [],
            "excludeRoles": [],
            "includeGuestsOrExternalUsers": null,
            "excludeGuestsOrExternalUsers": null
        },
        "platforms": {
            "includePlatforms": [
                "all"
            ],
            "excludePlatforms": [
                "android",
                "iOS",
                "windows",
                "macOS",
                "linux"
            ]
        }
    },
    "grantControls": {
        "operator": "OR",
        "builtInControls": [
            "block"
        ],
        "customAuthenticationFactors": [],
        "termsOfUse": [],
        "authenticationStrength@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies('4de43d03-7a26-4e3c-9c4d-07b570694c4e')/grantControls/authenticationStrength/$entity",
        "authenticationStrength": null
    }
}