{"id": "29c29eff-432f-45bd-a2c6-f8c75fb9c1ed", "displayName": "CA201-Internals-IdentityProtection-AllApps-AnyPlatform-CombinedRegistration", "createdDateTime": "2023-04-13T07:00:21.7645568Z", "modifiedDateTime": null, "state": "enabledForReportingButNotEnforced", "sessionControls": null, "conditions": {"userRiskLevels": [], "signInRiskLevels": [], "clientAppTypes": ["all"], "servicePrincipalRiskLevels": [], "locations": null, "times": null, "deviceStates": null, "devices": null, "clientApplications": null, "applications": {"includeApplications": [], "excludeApplications": [], "includeUserActions": ["urn:user:registersecurityinfo"], "includeAuthenticationContextClassReferences": []}, "users": {"includeUsers": [], "excludeUsers": [], "includeGroups": ["4dd02aca-9a06-4c68-8a44-97699a8450e4"], "excludeGroups": ["53afd8d4-7ba6-4728-832b-34c5ac878d4a", "cd02bb8a-403a-4d6d-a72e-ef3a55820fde"], "includeRoles": [], "excludeRoles": [], "includeGuestsOrExternalUsers": null, "excludeGuestsOrExternalUsers": null}, "platforms": {"includePlatforms": ["android", "iOS", "windows", "windowsPhone", "linux"], "excludePlatforms": ["macOS"]}}, "grantControls": {"operator": "OR", "builtInControls": ["compliantDevice", "domainJoinedDevice"], "customAuthenticationFactors": [], "termsOfUse": [], "authenticationStrength@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies('29c29eff-432f-45bd-a2c6-f8c75fb9c1ed')/grantControls/authenticationStrength/$entity", "authenticationStrength": null}}