{
    "id": "63b0014a-38b1-421e-9086-06a3ff1e636a",
    "displayName": "CA200_IdentityProtection_AllUsers_AllApps_AllPlatforms_BlockAccessLegacyAuthentication",
    "createdDateTime": "2022-09-20T09:11:29.5811884Z",
    "modifiedDateTime": null,
    "state": "enabledForReportingButNotEnforced",
    "sessionControls": null,
    "conditions": {
        "userRiskLevels": [],
        "signInRiskLevels": [],
        "clientAppTypes": [
            "exchangeActiveSync",
            "other"
        ],
        "servicePrincipalRiskLevels": [],
        "platforms": null,
        "locations": null,
        "times": null,
        "deviceStates": null,
        "devices": null,
        "clientApplications": null,
        "applications": {
            "includeApplications": [
                "All"
            ],
            "excludeApplications": [],
            "includeUserActions": [],
            "includeAuthenticationContextClassReferences": []
        },
        "users": {
            "includeUsers": [
                "All"
            ],
            "excludeUsers": [
                "66e5a220-1982-407d-b774-d2d7afe9160a"
            ],
            "includeGroups": [],
            "excludeGroups": [],
            "includeRoles": [],
            "excludeRoles": [
                "d29b2b05-8046-44ba-8758-1e26182fcf32"
            ],
            "includeGuestsOrExternalUsers": null,
            "excludeGuestsOrExternalUsers": null
        }
    },
    "grantControls": {
        "operator": "OR",
        "builtInControls": [
            "block"
        ],
        "customAuthenticationFactors": [],
        "termsOfUse": [],
        "authenticationStrength@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies('63b0014a-38b1-421e-9086-06a3ff1e636a')/grantControls/authenticationStrength/$entity",
        "authenticationStrength": null
    }
}