{"id": "d4bed1d1-41ee-48ee-8898-759334deea2a", "displayName": "CA206-Internals-DataandAppProtection-AllApps-iOSorAndroid-ClientAppORAPP", "createdDateTime": "2023-04-13T07:00:25.5890393Z", "modifiedDateTime": null, "state": "enabledForReportingButNotEnforced", "sessionControls": null, "conditions": {"userRiskLevels": [], "signInRiskLevels": [], "clientAppTypes": ["all"], "servicePrincipalRiskLevels": [], "locations": null, "times": null, "deviceStates": null, "devices": null, "clientApplications": null, "applications": {"includeApplications": ["Office365"], "excludeApplications": [], "includeUserActions": [], "includeAuthenticationContextClassReferences": []}, "users": {"includeUsers": [], "excludeUsers": [], "includeGroups": ["4dd02aca-9a06-4c68-8a44-97699a8450e4"], "excludeGroups": ["53afd8d4-7ba6-4728-832b-34c5ac878d4a", "cd02bb8a-403a-4d6d-a72e-ef3a55820fde"], "includeRoles": [], "excludeRoles": [], "includeGuestsOrExternalUsers": null, "excludeGuestsOrExternalUsers": null}, "platforms": {"includePlatforms": ["android", "iOS"], "excludePlatforms": []}}, "grantControls": {"operator": "OR", "builtInControls": ["approvedApplication", "compliantApplication"], "customAuthenticationFactors": [], "termsOfUse": [], "authenticationStrength@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies('d4bed1d1-41ee-48ee-8898-759334deea2a')/grantControls/authenticationStrength/$entity", "authenticationStrength": null}}