{"id": "ec98d8ff-06a2-40b2-84b4-1404fa10a9cf", "displayName": "CA302_DataProtection_ExternalUsers_AllApps_AllPlatforms_ShortSign-inFrequency", "createdDateTime": "2022-09-20T09:26:56.5985708Z", "modifiedDateTime": "2022-11-16T09:25:49.6629286Z", "state": "enabled", "grantControls": null, "conditions": {"userRiskLevels": [], "signInRiskLevels": [], "clientAppTypes": ["all"], "servicePrincipalRiskLevels": [], "platforms": null, "locations": null, "times": null, "deviceStates": null, "devices": null, "clientApplications": null, "applications": {"includeApplications": ["All"], "excludeApplications": [], "includeUserActions": [], "includeAuthenticationContextClassReferences": []}, "users": {"includeUsers": [], "excludeUsers": ["66e5a220-1982-407d-b774-d2d7afe9160a"], "includeGroups": [], "excludeGroups": [], "includeRoles": [], "excludeRoles": [], "excludeGuestsOrExternalUsers": null, "includeGuestsOrExternalUsers": {"guestOrExternalUserTypes": "internalGuest,b2bCollaborationGuest,b2bCollaborationMember,b2bDirectConnectUser,otherExternalUser,serviceProvider", "externalTenants": {"@odata.type": "#microsoft.graph.conditionalAccessAllExternalTenants", "membershipKind": "all"}}}}, "sessionControls": {"disableResilienceDefaults": false, "applicationEnforcedRestrictions": null, "cloudAppSecurity": null, "persistentBrowser": null, "continuousAccessEvaluation": null, "secureSignInSession": null, "signInFrequency": {"value": 8, "type": "hours", "authenticationType": "primaryAndSecondaryAuthentication", "frequencyInterval": "timeBased", "isEnabled": true}}}