{"id": "84ceb85b-b5ee-47cd-949a-c84acc4c60d8", "displayName": "CA301-Externals-IdentityProtection-AllApps-AnyPlatform-CombinedRegistration", "createdDateTime": "2023-04-13T07:00:28.1881388Z", "modifiedDateTime": null, "state": "enabledForReportingButNotEnforced", "sessionControls": null, "conditions": {"userRiskLevels": [], "signInRiskLevels": [], "clientAppTypes": ["all"], "servicePrincipalRiskLevels": [], "platforms": null, "locations": null, "times": null, "deviceStates": null, "devices": null, "clientApplications": null, "applications": {"includeApplications": [], "excludeApplications": [], "includeUserActions": ["urn:user:registersecurityinfo"], "includeAuthenticationContextClassReferences": []}, "users": {"includeUsers": [], "excludeUsers": [], "includeGroups": ["5253ba0b-6708-4ff1-9073-c1fe795023d1"], "excludeGroups": ["53afd8d4-7ba6-4728-832b-34c5ac878d4a", "0de4556f-4379-4e84-94eb-786aa2784fd1"], "includeRoles": [], "excludeRoles": [], "includeGuestsOrExternalUsers": null, "excludeGuestsOrExternalUsers": null}}, "grantControls": {"operator": "OR", "builtInControls": ["compliantDevice", "domainJoinedDevice"], "customAuthenticationFactors": [], "termsOfUse": [], "authenticationStrength@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies('84ceb85b-b5ee-47cd-949a-c84acc4c60d8')/grantControls/authenticationStrength/$entity", "authenticationStrength": null}}