{"id": "28fcd45a-ee42-405a-9834-3d8c779c5001", "displayName": "CA302_DataProtection_ExternalUsers_AllApps_AllPlatform_ShortSign-inFrequency", "createdDateTime": "2023-02-06T08:10:37.1588629Z", "modifiedDateTime": null, "state": "disabled", "grantControls": null, "conditions": {"userRiskLevels": [], "signInRiskLevels": [], "clientAppTypes": ["all"], "servicePrincipalRiskLevels": [], "platforms": null, "locations": null, "times": null, "deviceStates": null, "devices": null, "clientApplications": null, "applications": {"includeApplications": ["All"], "excludeApplications": [], "includeUserActions": [], "includeAuthenticationContextClassReferences": []}, "users": {"includeUsers": [], "excludeUsers": [], "includeGroups": [], "excludeGroups": ["796df650-fdb9-4ae2-9ec8-5355e4a4005b"], "includeRoles": [], "excludeRoles": [], "excludeGuestsOrExternalUsers": null, "includeGuestsOrExternalUsers": {"guestOrExternalUserTypes": "internalGuest,b2bCollaborationGuest,b2bCollaborationMember,b2bDirectConnectUser,otherExternalUser,serviceProvider", "externalTenants": {"@odata.type": "#microsoft.graph.conditionalAccessAllExternalTenants", "membershipKind": "all"}}}}, "sessionControls": {"disableResilienceDefaults": false, "applicationEnforcedRestrictions": null, "cloudAppSecurity": null, "persistentBrowser": null, "continuousAccessEvaluation": null, "secureSignInSession": null, "signInFrequency": {"value": 1, "type": "days", "authenticationType": "primaryAndSecondaryAuthentication", "frequencyInterval": "timeBased", "isEnabled": true}}}