{
    "id": "dcf0d785-6268-4ad3-91c9-5df10913b78f",
    "displayName": "CA300-Externals-BaseProtection-AllApps-AnyPlatform-CompliantorAADHJ",
    "createdDateTime": "2023-04-13T07:00:27.2630877Z",
    "modifiedDateTime": null,
    "state": "enabledForReportingButNotEnforced",
    "sessionControls": null,
    "conditions": {
        "userRiskLevels": [],
        "signInRiskLevels": [],
        "clientAppTypes": [
            "all"
        ],
        "servicePrincipalRiskLevels": [],
        "platforms": null,
        "locations": null,
        "times": null,
        "deviceStates": null,
        "devices": null,
        "clientApplications": null,
        "applications": {
            "includeApplications": [
                "All"
            ],
            "excludeApplications": [
                "0000000a-0000-0000-c000-000000000000"
            ],
            "includeUserActions": [],
            "includeAuthenticationContextClassReferences": []
        },
        "users": {
            "includeUsers": [],
            "excludeUsers": [],
            "includeGroups": [
                "5253ba0b-6708-4ff1-9073-c1fe795023d1"
            ],
            "excludeGroups": [
                "53afd8d4-7ba6-4728-832b-34c5ac878d4a",
                "0de4556f-4379-4e84-94eb-786aa2784fd1"
            ],
            "includeRoles": [],
            "excludeRoles": [],
            "includeGuestsOrExternalUsers": null,
            "excludeGuestsOrExternalUsers": null
        }
    },
    "grantControls": {
        "operator": "OR",
        "builtInControls": [
            "mfa",
            "compliantDevice",
            "domainJoinedDevice"
        ],
        "customAuthenticationFactors": [],
        "termsOfUse": [],
        "authenticationStrength@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies('dcf0d785-6268-4ad3-91c9-5df10913b78f')/grantControls/authenticationStrength/$entity",
        "authenticationStrength": null
    }
}