{
    "id": "7a35dbfe-3718-43fe-a721-7683957cc1e8",
    "displayName": "CA306-Externals-DataandAppProtection-AllApps-iOSorAndroid-ClientAppORAPP",
    "createdDateTime": "2023-04-13T07:00:31.0793094Z",
    "modifiedDateTime": null,
    "state": "enabledForReportingButNotEnforced",
    "sessionControls": null,
    "conditions": {
        "userRiskLevels": [],
        "signInRiskLevels": [],
        "clientAppTypes": [
            "all"
        ],
        "servicePrincipalRiskLevels": [],
        "locations": null,
        "times": null,
        "deviceStates": null,
        "devices": null,
        "clientApplications": null,
        "applications": {
            "includeApplications": [
                "Office365"
            ],
            "excludeApplications": [],
            "includeUserActions": [],
            "includeAuthenticationContextClassReferences": []
        },
        "users": {
            "includeUsers": [],
            "excludeUsers": [],
            "includeGroups": [
                "5253ba0b-6708-4ff1-9073-c1fe795023d1"
            ],
            "excludeGroups": [
                "53afd8d4-7ba6-4728-832b-34c5ac878d4a",
                "0de4556f-4379-4e84-94eb-786aa2784fd1"
            ],
            "includeRoles": [],
            "excludeRoles": [],
            "includeGuestsOrExternalUsers": null,
            "excludeGuestsOrExternalUsers": null
        },
        "platforms": {
            "includePlatforms": [
                "android",
                "iOS"
            ],
            "excludePlatforms": []
        }
    },
    "grantControls": {
        "operator": "OR",
        "builtInControls": [
            "approvedApplication",
            "compliantApplication"
        ],
        "customAuthenticationFactors": [],
        "termsOfUse": [],
        "authenticationStrength@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies('7a35dbfe-3718-43fe-a721-7683957cc1e8')/grantControls/authenticationStrength/$entity",
        "authenticationStrength": null
    }
}