{
    "id": "58306146-5c93-495b-b5cf-60ffb94ffacc",
    "displayName": "CA403-Guests-IdentityProtection-AllApps-AnyPlatform-BlockLegacyAuth",
    "createdDateTime": "2023-04-13T07:00:33.5526558Z",
    "modifiedDateTime": null,
    "state": "enabledForReportingButNotEnforced",
    "sessionControls": null,
    "conditions": {
        "userRiskLevels": [],
        "signInRiskLevels": [],
        "clientAppTypes": [
            "exchangeActiveSync",
            "other"
        ],
        "servicePrincipalRiskLevels": [],
        "platforms": null,
        "locations": null,
        "times": null,
        "deviceStates": null,
        "devices": null,
        "clientApplications": null,
        "applications": {
            "includeApplications": [
                "All"
            ],
            "excludeApplications": [],
            "includeUserActions": [],
            "includeAuthenticationContextClassReferences": []
        },
        "users": {
            "includeUsers": [],
            "excludeUsers": [],
            "includeGroups": [],
            "excludeGroups": [
                "53afd8d4-7ba6-4728-832b-34c5ac878d4a",
                "35a8adb4-e601-4645-8538-956d80f586aa"
            ],
            "includeRoles": [],
            "excludeRoles": [],
            "excludeGuestsOrExternalUsers": null,
            "includeGuestsOrExternalUsers": {
                "guestOrExternalUserTypes": "internalGuest,b2bCollaborationGuest,b2bCollaborationMember,b2bDirectConnectUser,otherExternalUser,serviceProvider",
                "externalTenants": {
                    "@odata.type": "#microsoft.graph.conditionalAccessAllExternalTenants",
                    "membershipKind": "all"
                }
            }
        }
    },
    "grantControls": {
        "operator": "OR",
        "builtInControls": [
            "block"
        ],
        "customAuthenticationFactors": [],
        "termsOfUse": [],
        "authenticationStrength@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies('58306146-5c93-495b-b5cf-60ffb94ffacc')/grantControls/authenticationStrength/$entity",
        "authenticationStrength": null
    }
}