{"id": "2a8edda7-615a-4372-bc06-9f168281f848", "displayName": "CA504_AttackSurfaceReduction_ExternalUsers_AllApps_UnkownDevicePlatform_BlockAccess", "createdDateTime": "2023-02-06T09:05:58.0360407Z", "modifiedDateTime": "2023-02-06T09:06:08.3437768Z", "state": "disabled", "sessionControls": null, "conditions": {"userRiskLevels": [], "signInRiskLevels": [], "clientAppTypes": ["all"], "servicePrincipalRiskLevels": [], "locations": null, "times": null, "deviceStates": null, "devices": null, "clientApplications": null, "applications": {"includeApplications": ["All"], "excludeApplications": [], "includeUserActions": [], "includeAuthenticationContextClassReferences": []}, "users": {"includeUsers": [], "excludeUsers": [], "includeGroups": [], "excludeGroups": ["796df650-fdb9-4ae2-9ec8-5355e4a4005b"], "includeRoles": [], "excludeRoles": [], "excludeGuestsOrExternalUsers": null, "includeGuestsOrExternalUsers": {"guestOrExternalUserTypes": "internalGuest,b2bCollaborationGuest,b2bCollaborationMember,b2bDirectConnectUser,otherExternalUser,serviceProvider", "externalTenants": {"@odata.type": "#microsoft.graph.conditionalAccessAllExternalTenants", "membershipKind": "all"}}}, "platforms": {"includePlatforms": ["android", "iOS", "windowsPhone", "linux"], "excludePlatforms": []}}, "grantControls": {"operator": "OR", "builtInControls": ["block"], "customAuthenticationFactors": [], "termsOfUse": [], "authenticationStrength@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies('2a8edda7-615a-4372-bc06-9f168281f848')/grantControls/authenticationStrength/$entity", "authenticationStrength": null}}