{"id": "ae73c5a3-b5ff-47c9-a359-b33eb4d733d0", "displayName": "CA504-GuestAdmins-AttackSurfaceReduction-AllApps-AnyPlatform-BlockNonGuestAdminsAppAccess", "createdDateTime": "2023-04-13T07:00:37.3965375Z", "modifiedDateTime": null, "state": "enabledForReportingButNotEnforced", "sessionControls": null, "conditions": {"userRiskLevels": [], "signInRiskLevels": [], "clientAppTypes": ["all"], "servicePrincipalRiskLevels": [], "platforms": null, "locations": null, "times": null, "deviceStates": null, "devices": null, "clientApplications": null, "applications": {"includeApplications": ["All"], "excludeApplications": ["797f4846-ba00-4fd7-ba43-dac1f8f63013", "2793995e-0a7d-40d7-bd35-6968ba142197", "Office365"], "includeUserActions": [], "includeAuthenticationContextClassReferences": []}, "users": {"includeUsers": [], "excludeUsers": [], "includeGroups": ["15da3d9b-ec93-4d53-8c26-df1a0cf8fb11"], "excludeGroups": ["53afd8d4-7ba6-4728-832b-34c5ac878d4a", "34de2794-0d3c-4131-a579-23a28bbc0168"], "includeRoles": [], "excludeRoles": [], "includeGuestsOrExternalUsers": null, "excludeGuestsOrExternalUsers": null}}, "grantControls": {"operator": "OR", "builtInControls": ["block"], "customAuthenticationFactors": [], "termsOfUse": [], "authenticationStrength@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies('ae73c5a3-b5ff-47c9-a359-b33eb4d733d0')/grantControls/authenticationStrength/$entity", "authenticationStrength": null}}