{"id": "14d0ecac-08da-492d-9268-8e54b044586d", "displayName": "CA506_AttackSurfaceReduction_SeviceAccounts_AllApps_AllPlatforms_UntrustedLocation_BlockAccess", "createdDateTime": "2023-02-06T09:14:18.2467579Z", "modifiedDateTime": "2023-02-06T11:00:06.3005367Z", "state": "disabled", "sessionControls": null, "conditions": {"userRiskLevels": [], "signInRiskLevels": [], "clientAppTypes": ["all"], "servicePrincipalRiskLevels": [], "platforms": null, "times": null, "deviceStates": null, "devices": null, "clientApplications": null, "applications": {"includeApplications": ["All"], "excludeApplications": [], "includeUserActions": [], "includeAuthenticationContextClassReferences": []}, "users": {"includeUsers": [], "excludeUsers": [], "includeGroups": ["1e692340-c963-4ed3-8c37-8d3d65a8dced"], "excludeGroups": ["796df650-fdb9-4ae2-9ec8-5355e4a4005b"], "includeRoles": [], "excludeRoles": [], "includeGuestsOrExternalUsers": null, "excludeGuestsOrExternalUsers": null}, "locations": {"includeLocations": ["All"], "excludeLocations": ["02f7bea8-a275-4dd4-b585-930eb4d33778"]}}, "grantControls": {"operator": "OR", "builtInControls": ["block"], "customAuthenticationFactors": [], "termsOfUse": [], "authenticationStrength@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies('14d0ecac-08da-492d-9268-8e54b044586d')/grantControls/authenticationStrength/$entity", "authenticationStrength": null}}