{"id": "e738800b-3984-4f08-a8f0-6149d4cf6310", "displayName": "CA500_AttackSurfaceReduction_AllUsers_AllApps_Android&WindowsPhoneDevices_BlockAccess", "createdDateTime": "2022-09-20T09:29:52.0854934Z", "modifiedDateTime": null, "state": "enabledForReportingButNotEnforced", "sessionControls": null, "conditions": {"userRiskLevels": [], "signInRiskLevels": [], "clientAppTypes": ["all"], "servicePrincipalRiskLevels": [], "locations": null, "times": null, "deviceStates": null, "devices": null, "clientApplications": null, "applications": {"includeApplications": ["All"], "excludeApplications": [], "includeUserActions": [], "includeAuthenticationContextClassReferences": []}, "users": {"includeUsers": ["All"], "excludeUsers": ["66e5a220-1982-407d-b774-d2d7afe9160a"], "includeGroups": [], "excludeGroups": [], "includeRoles": [], "excludeRoles": [], "includeGuestsOrExternalUsers": null, "excludeGuestsOrExternalUsers": null}, "platforms": {"includePlatforms": ["android", "windowsPhone"], "excludePlatforms": []}}, "grantControls": {"operator": "OR", "builtInControls": ["block"], "customAuthenticationFactors": [], "termsOfUse": [], "authenticationStrength@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies('e738800b-3984-4f08-a8f0-6149d4cf6310')/grantControls/authenticationStrength/$entity", "authenticationStrength": null}}