{"id": "128e8077-57af-4a95-924b-84e3465ab6b4", "displayName": "CA600-Microsoft365ServiceAccounts-BaseProtection-AllApps-AnyPlatform-BlockUntrustedLocations", "createdDateTime": "2023-04-13T07:00:39.1369517Z", "modifiedDateTime": null, "state": "enabledForReportingButNotEnforced", "sessionControls": null, "conditions": {"userRiskLevels": [], "signInRiskLevels": [], "clientAppTypes": ["all"], "servicePrincipalRiskLevels": [], "platforms": null, "times": null, "deviceStates": null, "devices": null, "clientApplications": null, "applications": {"includeApplications": ["None"], "excludeApplications": [], "includeUserActions": [], "includeAuthenticationContextClassReferences": []}, "users": {"includeUsers": [], "excludeUsers": [], "includeGroups": ["3ebfafa7-8469-48d7-b678-610b675c0d38"], "excludeGroups": ["53afd8d4-7ba6-4728-832b-34c5ac878d4a", "2e20a9a6-c52f-407c-9d55-505e6f024e9b"], "includeRoles": [], "excludeRoles": [], "includeGuestsOrExternalUsers": null, "excludeGuestsOrExternalUsers": null}, "locations": {"includeLocations": ["All"], "excludeLocations": ["0acd609a-7b7b-4a3a-8313-01e119c6aaf8"]}}, "grantControls": {"operator": "OR", "builtInControls": ["block"], "customAuthenticationFactors": [], "termsOfUse": [], "authenticationStrength@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies('128e8077-57af-4a95-924b-84e3465ab6b4')/grantControls/authenticationStrength/$entity", "authenticationStrength": null}}