{
    "id": "96a84aaf-e09a-49b2-9b1f-24fbc3d44b78",
    "displayName": "CA601-Microsoft365ServiceAccounts-IdentityProtection-AllApps-AnyPlatform-BlockLegacyAuth",
    "createdDateTime": "2023-04-13T07:00:40.1924147Z",
    "modifiedDateTime": null,
    "state": "enabledForReportingButNotEnforced",
    "sessionControls": null,
    "conditions": {
        "userRiskLevels": [],
        "signInRiskLevels": [],
        "clientAppTypes": [
            "exchangeActiveSync",
            "other"
        ],
        "servicePrincipalRiskLevels": [],
        "platforms": null,
        "times": null,
        "deviceStates": null,
        "devices": null,
        "clientApplications": null,
        "applications": {
            "includeApplications": [
                "None"
            ],
            "excludeApplications": [],
            "includeUserActions": [],
            "includeAuthenticationContextClassReferences": []
        },
        "users": {
            "includeUsers": [],
            "excludeUsers": [],
            "includeGroups": [
                "3ebfafa7-8469-48d7-b678-610b675c0d38"
            ],
            "excludeGroups": [
                "53afd8d4-7ba6-4728-832b-34c5ac878d4a",
                "2e20a9a6-c52f-407c-9d55-505e6f024e9b"
            ],
            "includeRoles": [],
            "excludeRoles": [],
            "includeGuestsOrExternalUsers": null,
            "excludeGuestsOrExternalUsers": null
        },
        "locations": {
            "includeLocations": [
                "All"
            ],
            "excludeLocations": []
        }
    },
    "grantControls": {
        "operator": "OR",
        "builtInControls": [
            "block"
        ],
        "customAuthenticationFactors": [],
        "termsOfUse": [],
        "authenticationStrength@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies('96a84aaf-e09a-49b2-9b1f-24fbc3d44b78')/grantControls/authenticationStrength/$entity",
        "authenticationStrength": null
    }
}