{"id": "0d60446d-97e1-45d6-8ef5-42c93b9debdc", "displayName": "CA602-Microsoft365ServiceAccounts-AttackSurfaceReduction-O365-AnyPlatform-BlockNonO365", "createdDateTime": "2023-04-13T07:00:41.1017782Z", "modifiedDateTime": null, "state": "enabledForReportingButNotEnforced", "sessionControls": null, "conditions": {"userRiskLevels": [], "signInRiskLevels": [], "clientAppTypes": ["all"], "servicePrincipalRiskLevels": [], "platforms": null, "times": null, "deviceStates": null, "devices": null, "clientApplications": null, "applications": {"includeApplications": ["All"], "excludeApplications": ["Office365"], "includeUserActions": [], "includeAuthenticationContextClassReferences": []}, "users": {"includeUsers": [], "excludeUsers": [], "includeGroups": ["3ebfafa7-8469-48d7-b678-610b675c0d38"], "excludeGroups": ["53afd8d4-7ba6-4728-832b-34c5ac878d4a", "2e20a9a6-c52f-407c-9d55-505e6f024e9b"], "includeRoles": [], "excludeRoles": [], "includeGuestsOrExternalUsers": null, "excludeGuestsOrExternalUsers": null}, "locations": {"includeLocations": ["All"], "excludeLocations": []}}, "grantControls": {"operator": "OR", "builtInControls": ["block"], "customAuthenticationFactors": [], "termsOfUse": [], "authenticationStrength@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies('0d60446d-97e1-45d6-8ef5-42c93b9debdc')/grantControls/authenticationStrength/$entity", "authenticationStrength": null}}