{"id": "6f315b12-6740-41d5-a48d-324157701077", "displayName": "CA700-AzureServiceAccounts-BaseProtection-AllApps-AnyPlatform-BlockUntrustedLocations", "createdDateTime": "2023-04-13T07:00:41.887655Z", "modifiedDateTime": null, "state": "enabledForReportingButNotEnforced", "sessionControls": null, "conditions": {"userRiskLevels": [], "signInRiskLevels": [], "clientAppTypes": ["all"], "servicePrincipalRiskLevels": [], "platforms": null, "times": null, "deviceStates": null, "devices": null, "clientApplications": null, "applications": {"includeApplications": ["None"], "excludeApplications": [], "includeUserActions": [], "includeAuthenticationContextClassReferences": []}, "users": {"includeUsers": [], "excludeUsers": [], "includeGroups": ["2f3de830-61db-4c02-ad21-eb614589b0ce"], "excludeGroups": ["53afd8d4-7ba6-4728-832b-34c5ac878d4a", "8c447fac-3bfc-4e55-bd05-9f2b56e33816"], "includeRoles": [], "excludeRoles": [], "includeGuestsOrExternalUsers": null, "excludeGuestsOrExternalUsers": null}, "locations": {"includeLocations": ["All"], "excludeLocations": ["0acd609a-7b7b-4a3a-8313-01e119c6aaf8"]}}, "grantControls": {"operator": "OR", "builtInControls": ["block"], "customAuthenticationFactors": [], "termsOfUse": [], "authenticationStrength@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies('6f315b12-6740-41d5-a48d-324157701077')/grantControls/authenticationStrength/$entity", "authenticationStrength": null}}