{"id": "a1467b8f-ce20-4e4d-a38a-ea1613ec22ae", "displayName": "CA702-AzureServiceAccounts-AttackSurfaceReduction-O365-AnyPlatform-BlockNonO365", "createdDateTime": "2023-04-13T07:00:43.6658582Z", "modifiedDateTime": null, "state": "enabledForReportingButNotEnforced", "sessionControls": null, "conditions": {"userRiskLevels": [], "signInRiskLevels": [], "clientAppTypes": ["all"], "servicePrincipalRiskLevels": [], "platforms": null, "times": null, "deviceStates": null, "devices": null, "clientApplications": null, "applications": {"includeApplications": ["All"], "excludeApplications": ["Office365"], "includeUserActions": [], "includeAuthenticationContextClassReferences": []}, "users": {"includeUsers": [], "excludeUsers": [], "includeGroups": ["2f3de830-61db-4c02-ad21-eb614589b0ce"], "excludeGroups": ["8c447fac-3bfc-4e55-bd05-9f2b56e33816", "53afd8d4-7ba6-4728-832b-34c5ac878d4a"], "includeRoles": [], "excludeRoles": [], "includeGuestsOrExternalUsers": null, "excludeGuestsOrExternalUsers": null}, "locations": {"includeLocations": ["All"], "excludeLocations": []}}, "grantControls": {"operator": "OR", "builtInControls": ["block"], "customAuthenticationFactors": [], "termsOfUse": [], "authenticationStrength@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies('a1467b8f-ce20-4e4d-a38a-ea1613ec22ae')/grantControls/authenticationStrength/$entity", "authenticationStrength": null}}