{"id": "65d3a6f6-7157-4598-9a84-06b6c34567e0", "displayName": "CA801-CorpServiceAccounts-IdentityProtection-AllApps-AnyPlatform-BlockLegacyAuth", "createdDateTime": "2023-04-13T07:00:45.652657Z", "modifiedDateTime": null, "state": "enabledForReportingButNotEnforced", "sessionControls": null, "conditions": {"userRiskLevels": [], "signInRiskLevels": [], "clientAppTypes": ["exchangeActiveSync", "other"], "servicePrincipalRiskLevels": [], "platforms": null, "times": null, "deviceStates": null, "devices": null, "clientApplications": null, "applications": {"includeApplications": ["None"], "excludeApplications": [], "includeUserActions": [], "includeAuthenticationContextClassReferences": []}, "users": {"includeUsers": [], "excludeUsers": [], "includeGroups": ["e3ff23b4-80be-48e3-aaca-cd2f69f5d9a3"], "excludeGroups": ["53afd8d4-7ba6-4728-832b-34c5ac878d4a", "cb3395e3-a23a-4d15-8f8f-b266c36d0c67"], "includeRoles": [], "excludeRoles": [], "includeGuestsOrExternalUsers": null, "excludeGuestsOrExternalUsers": null}, "locations": {"includeLocations": ["All"], "excludeLocations": []}}, "grantControls": {"operator": "OR", "builtInControls": ["block"], "customAuthenticationFactors": [], "termsOfUse": [], "authenticationStrength@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies('65d3a6f6-7157-4598-9a84-06b6c34567e0')/grantControls/authenticationStrength/$entity", "authenticationStrength": null}}