{"id": "fe0c8335-b90a-43d1-8a96-e12c624f2b35", "displayName": "CA800-CorpServiceAccounts-BaseProtection-AllApps-AnyPlatform-BlockUntrustedLocations", "createdDateTime": "2023-04-13T07:00:44.5983548Z", "modifiedDateTime": null, "state": "enabledForReportingButNotEnforced", "sessionControls": null, "conditions": {"userRiskLevels": [], "signInRiskLevels": [], "clientAppTypes": ["all"], "servicePrincipalRiskLevels": [], "platforms": null, "times": null, "deviceStates": null, "devices": null, "clientApplications": null, "applications": {"includeApplications": ["None"], "excludeApplications": [], "includeUserActions": [], "includeAuthenticationContextClassReferences": []}, "users": {"includeUsers": [], "excludeUsers": [], "includeGroups": ["e3ff23b4-80be-48e3-aaca-cd2f69f5d9a3"], "excludeGroups": ["53afd8d4-7ba6-4728-832b-34c5ac878d4a", "cb3395e3-a23a-4d15-8f8f-b266c36d0c67"], "includeRoles": [], "excludeRoles": [], "includeGuestsOrExternalUsers": null, "excludeGuestsOrExternalUsers": null}, "locations": {"includeLocations": ["All"], "excludeLocations": ["0acd609a-7b7b-4a3a-8313-01e119c6aaf8"]}}, "grantControls": {"operator": "OR", "builtInControls": ["block"], "customAuthenticationFactors": [], "termsOfUse": [], "authenticationStrength@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies('fe0c8335-b90a-43d1-8a96-e12c624f2b35')/grantControls/authenticationStrength/$entity", "authenticationStrength": null}}