{"id": "8ba9f291-4475-45d5-b29f-b40258f4db5a", "displayName": "CA802-CorpServiceAccounts-AttackSurfaceReduction-O365-AnyPlatform-BlockNonO365andAzure", "createdDateTime": "2023-04-13T07:00:46.504692Z", "modifiedDateTime": null, "state": "enabledForReportingButNotEnforced", "sessionControls": null, "conditions": {"userRiskLevels": [], "signInRiskLevels": [], "clientAppTypes": ["all"], "servicePrincipalRiskLevels": [], "platforms": null, "times": null, "deviceStates": null, "devices": null, "clientApplications": null, "applications": {"includeApplications": ["All"], "excludeApplications": ["797f4846-ba00-4fd7-ba43-dac1f8f63013", "Office365"], "includeUserActions": [], "includeAuthenticationContextClassReferences": []}, "users": {"includeUsers": [], "excludeUsers": [], "includeGroups": ["e3ff23b4-80be-48e3-aaca-cd2f69f5d9a3"], "excludeGroups": ["53afd8d4-7ba6-4728-832b-34c5ac878d4a", "cb3395e3-a23a-4d15-8f8f-b266c36d0c67"], "includeRoles": [], "excludeRoles": [], "includeGuestsOrExternalUsers": null, "excludeGuestsOrExternalUsers": null}, "locations": {"includeLocations": ["All"], "excludeLocations": []}}, "grantControls": {"operator": "OR", "builtInControls": ["block"], "customAuthenticationFactors": [], "termsOfUse": [], "authenticationStrength@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies('8ba9f291-4475-45d5-b29f-b40258f4db5a')/grantControls/authenticationStrength/$entity", "authenticationStrength": null}}