{
    "id": "675e33b1-97ba-4a22-b661-8c77456b919b",
    "displayName": "Citrix_Gateway_Anmeldung_MFA_ShortSigninFrequency",
    "createdDateTime": "2022-08-09T11:14:29.6008485Z",
    "modifiedDateTime": "2022-10-14T08:13:10.1698846Z",
    "state": "enabled",
    "conditions": {
        "userRiskLevels": [],
        "signInRiskLevels": [],
        "clientAppTypes": [
            "all"
        ],
        "servicePrincipalRiskLevels": [],
        "platforms": null,
        "locations": null,
        "times": null,
        "deviceStates": null,
        "devices": null,
        "clientApplications": null,
        "applications": {
            "includeApplications": [
                "f8893ddc-162b-4d19-bf4b-b6e9da8c925c"
            ],
            "excludeApplications": [],
            "includeUserActions": [],
            "includeAuthenticationContextClassReferences": []
        },
        "users": {
            "includeUsers": [],
            "excludeUsers": [
                "66e5a220-1982-407d-b774-d2d7afe9160a"
            ],
            "includeGroups": [
                "56957df3-b664-47c4-957d-f3a198414564"
            ],
            "excludeGroups": [],
            "includeRoles": [],
            "excludeRoles": [],
            "includeGuestsOrExternalUsers": null,
            "excludeGuestsOrExternalUsers": null
        }
    },
    "grantControls": {
        "operator": "OR",
        "builtInControls": [
            "mfa"
        ],
        "customAuthenticationFactors": [],
        "termsOfUse": [],
        "authenticationStrength@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies('675e33b1-97ba-4a22-b661-8c77456b919b')/grantControls/authenticationStrength/$entity",
        "authenticationStrength": null
    },
    "sessionControls": {
        "disableResilienceDefaults": false,
        "applicationEnforcedRestrictions": null,
        "cloudAppSecurity": null,
        "persistentBrowser": null,
        "continuousAccessEvaluation": null,
        "secureSignInSession": null,
        "signInFrequency": {
            "value": 12,
            "type": "hours",
            "authenticationType": "primaryAndSecondaryAuthentication",
            "frequencyInterval": "timeBased",
            "isEnabled": true
        }
    }
}