{"id": "3ede2e62-3141-4e42-826d-34e83e8c9727", "displayName": "Confidential Site Block Downloads", "createdDateTime": "2023-01-28T05:03:13.1955162Z", "modifiedDateTime": "2023-02-06T10:28:36.570056Z", "state": "disabled", "grantControls": null, "conditions": {"userRiskLevels": [], "signInRiskLevels": [], "clientAppTypes": ["all"], "servicePrincipalRiskLevels": [], "platforms": null, "locations": null, "times": null, "deviceStates": null, "devices": null, "clientApplications": null, "applications": {"includeApplications": [], "excludeApplications": [], "includeUserActions": [], "includeAuthenticationContextClassReferences": ["c2"]}, "users": {"includeUsers": ["All"], "excludeUsers": [], "includeGroups": [], "excludeGroups": [], "includeRoles": [], "excludeRoles": [], "includeGuestsOrExternalUsers": null, "excludeGuestsOrExternalUsers": null}}, "sessionControls": {"disableResilienceDefaults": false, "applicationEnforcedRestrictions": null, "signInFrequency": null, "persistentBrowser": null, "continuousAccessEvaluation": null, "secureSignInSession": null, "cloudAppSecurity": {"cloudAppSecurityType": "blockDownloads", "isEnabled": true}}}