{"id": "a71cd184-d9af-429a-856e-a2bc5e7392b8", "displayName": "Require MFA", "createdDateTime": "2022-07-06T09:01:05.5281261Z", "modifiedDateTime": "2023-02-02T18:42:05.4687559Z", "state": "enabled", "sessionControls": null, "conditions": {"userRiskLevels": [], "signInRiskLevels": [], "clientAppTypes": ["all"], "servicePrincipalRiskLevels": [], "platforms": null, "locations": null, "times": null, "deviceStates": null, "devices": null, "clientApplications": null, "applications": {"includeApplications": ["All"], "excludeApplications": [], "includeUserActions": [], "includeAuthenticationContextClassReferences": []}, "users": {"includeUsers": ["0c20375b-f7c6-41df-90c5-e083474a1627", "d56d3e31-ff03-4a0a-8155-a129c67a4296"], "excludeUsers": [], "includeGroups": [], "excludeGroups": [], "includeRoles": [], "excludeRoles": [], "includeGuestsOrExternalUsers": null, "excludeGuestsOrExternalUsers": null}}, "grantControls": {"operator": "OR", "builtInControls": ["mfa"], "customAuthenticationFactors": [], "termsOfUse": [], "authenticationStrength@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies('a71cd184-d9af-429a-856e-a2bc5e7392b8')/grantControls/authenticationStrength/$entity", "authenticationStrength": null}}