{"id": "92088176-5a06-41b6-8d6f-1f4798910c1c", "displayName": "Require MFA for InternalUsers for ALL Office365 APP - Outside Trusted Locations", "createdDateTime": "2022-09-13T09:44:00.4711307Z", "modifiedDateTime": "2023-02-17T08:14:35.2421416Z", "state": "enabled", "conditions": {"userRiskLevels": [], "signInRiskLevels": [], "clientAppTypes": ["all"], "servicePrincipalRiskLevels": [], "platforms": null, "times": null, "deviceStates": null, "devices": null, "clientApplications": null, "applications": {"includeApplications": ["Office365"], "excludeApplications": [], "includeUserActions": [], "includeAuthenticationContextClassReferences": []}, "users": {"includeUsers": [], "excludeUsers": ["66e5a220-1982-407d-b774-d2d7afe9160a"], "includeGroups": ["56957df3-b664-47c4-957d-f3a198414564", "22822f03-ff5a-4394-a8b2-da096d9a22d6"], "excludeGroups": [], "includeRoles": [], "excludeRoles": [], "includeGuestsOrExternalUsers": null, "excludeGuestsOrExternalUsers": null}, "locations": {"includeLocations": ["All"], "excludeLocations": ["00000000-0000-0000-0000-000000000000", "0758c34e-f17c-46bc-b7be-92c5194230f2", "040940f5-b676-4c44-a756-a29a65b41243"]}}, "grantControls": {"operator": "OR", "builtInControls": ["mfa"], "customAuthenticationFactors": [], "termsOfUse": [], "authenticationStrength@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies('92088176-5a06-41b6-8d6f-1f4798910c1c')/grantControls/authenticationStrength/$entity", "authenticationStrength": null}, "sessionControls": {"disableResilienceDefaults": false, "applicationEnforcedRestrictions": null, "cloudAppSecurity": null, "persistentBrowser": null, "continuousAccessEvaluation": null, "secureSignInSession": null, "signInFrequency": {"value": 7, "type": "days", "authenticationType": "primaryAndSecondaryAuthentication", "frequencyInterval": "timeBased", "isEnabled": true}}}